module Enqm.Ecology.Sharding.Distribution.Assurance where

{-


Заверение при распределении информации шардинг функционалом

какие заверения могут потребоваться и от кого ?

какие могут быть заверения и о чём ?

почему заверения нужны именно при распределении ?

что будет если не воспользоваться заверениями в некоторых случаях ?

можно ли использовать заверения если информация уже была распределена ?

в каких случаях и какие заверения трудновыполнимы ?

в каких случаях и какие заверения легковыполнимы ?

в каких случаях заверения не нужны ?

в каких случаях заверения не возможны ?


-}

